In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
nbadra = ".//Resources/NBA_1980_2017.csv" 
nbadra_df = pd.read_csv(nbadra)

nbadra_df.dropna(subset=['player'], inplace=True)
nbadra_df.head()

   year  round  pick              player position        school
0  1980      1     1  Carroll, Joe Barry      F/C        Purdue
1  1980      1     2   Griffith, Darrell        G    Louisville
2  1980      1     3       McHale, Kevin      F/C     Minnesota
3  1980      1     4      Ransey, Kelvin        G    Ohio State
4  1980      1     5          Ray, James        F  Jacksonville

In [4]:
finalNba =nbadra_df.rename(index=str, columns={'year':'YEAR','round':'ROUND','pick':'PICK','position':'POSITION','school':'COLLEGE',"player": "PLAYER"})
finalNba= finalNba.reset_index()
finalNba.head(10)

,index,YEAR,ROUND,PICK,PLAYER,POSITION,COLLEGE
0,0,1980,1,1,"Carroll, Joe Barry",F/C,Purdue
1,1,1980,1,2,"Griffith, Darrell",G,Louisville
2,2,1980,1,3,"McHale, Kevin",F/C,Minnesota
3,3,1980,1,4,"Ransey, Kelvin",G,Ohio State
4,4,1980,1,5,"Ray, James",F,Jacksonville
5,5,1980,1,6,"O'Koren, Mike",G/F,North Carolina
6,6,1980,1,7,"Gminski, Mike",C,Duke
7,7,1980,1,8,"Toney, Andrew",G,Southwestern Louisiana
8,8,1980,1,9,"Brooks, Michael",F,La Salle
9,9,1980,1,10,"Lester, Ronnie",G,Iowa

In [5]:
ncaab = ".//Resources/NCAAB.csv"
ncaab_df = pd.read_csv(ncaab)
ncaab_df.head()

,YEAR,CHAMPION (RECORD),COACH,SCORE,RUNNER-UP,SITE
0,2019,Virginia (35-3),Tony Bennett,85-77 (OT),Texas Tech,"Minneapolis, Minn."
1,2018,Villanova (36-4),Jay Wright,79-62,Michigan,"San Antonio, Tex."
2,2017,North Carolina (33-7),Roy Williams,71-65,Gonzaga,"Phoenix, Ariz."
3,2016,Villanova (35-5),Jay Wright,77-74,North Carolina,"Houston, Texas"
4,2015,Duke (35-4),Mike Krzyzewski,68-63,Wisconsin,"Indianapolis, Ind."

In [6]:
ncaab_df = ncaab_df.rename(columns={"CHAMPION (RECORD)": "Champion"})

In [7]:
ncaab_df.head()

,YEAR,Champion,COACH,SCORE,RUNNER-UP,SITE
0,2019,Virginia (35-3),Tony Bennett,85-77 (OT),Texas Tech,"Minneapolis, Minn."
1,2018,Villanova (36-4),Jay Wright,79-62,Michigan,"San Antonio, Tex."
2,2017,North Carolina (33-7),Roy Williams,71-65,Gonzaga,"Phoenix, Ariz."
3,2016,Villanova (35-5),Jay Wright,77-74,North Carolina,"Houston, Texas"
4,2015,Duke (35-4),Mike Krzyzewski,68-63,Wisconsin,"Indianapolis, Ind."

In [8]:
ncaab_df["Champion"] = ncaab_df.Champion.str.split("(", expand = True)
ncaab_df.head()

,YEAR,Champion,COACH,SCORE,RUNNER-UP,SITE
0,2019,Virginia,Tony Bennett,85-77 (OT),Texas Tech,"Minneapolis, Minn."
1,2018,Villanova,Jay Wright,79-62,Michigan,"San Antonio, Tex."
2,2017,North Carolina,Roy Williams,71-65,Gonzaga,"Phoenix, Ariz."
3,2016,Villanova,Jay Wright,77-74,North Carolina,"Houston, Texas"
4,2015,Duke,Mike Krzyzewski,68-63,Wisconsin,"Indianapolis, Ind."

In [9]:
# Create a filtered dataframe from specific columns
ncaab_cols = ["YEAR", "Champion", "COACH"]
ncaab_transformed= ncaab_df[ncaab_cols].copy()

ncaab_transformed.head()

   YEAR         Champion            COACH
0  2019        Virginia      Tony Bennett
1  2018       Villanova        Jay Wright
2  2017  North Carolina      Roy Williams
3  2016       Villanova        Jay Wright
4  2015            Duke   Mike Krzyzewski

In [10]:
#Pick NBA players datafile
nba_players = ".//Resources/NBABirth.csv"
nba_players_df = pd.read_csv(nba_players)
nba_players_df.head()

,Player,Yrs,G,MP,FG,FGA,3P,3PA,FT,FTA,...,FG%,3P%,FT%,MP.1,PTS.1,TRB.1,AST.1,Date,City,State
0,Michael Ansley,3,149,2143,383,746,0,0,260,360,...,0.513,NaN,0.722,14.4,6.9,4.2,0.4,"Feb 8, 1967",Birmingham,Alabama
1,Keith Askins,9,486,7983,677,1688,275,774,223,311,...,0.401,0.355,0.717,16.4,3.8,2.9,0.8,"Dec 15, 1967",Athens,Alabama
2,Carl Bailey,1,1,7,1,1,0,0,0,0,...,1,NaN,NaN,7,2,0,0,"Apr 23, 1958",Birmingham,Alabama
3,Charles Barkley*,16,1073,39330,8435,15605,538,2020,6349,8643,...,0.541,0.266,0.735,36.7,22.1,11.7,3.9,"Feb 20, 1963",Leeds,Alabama
4,Eric Bledsoe,7,380,10039,1657,3709,294,890,1042,1325,...,0.447,0.33,0.786,26.4,12.2,3.7,4.4,"Dec 9, 1989",Birmingham,Alabama

In [11]:
#Pick player birthdate and city
player_df = nba_players_df[["Player","Date","City","State"]].copy()
player_df.head()

             Player          Date        City    State
0    Michael Ansley   Feb 8, 1967  Birmingham  Alabama
1      Keith Askins  Dec 15, 1967      Athens  Alabama
2       Carl Bailey  Apr 23, 1958  Birmingham  Alabama
3  Charles Barkley*  Feb 20, 1963       Leeds  Alabama
4      Eric Bledsoe   Dec 9, 1989  Birmingham  Alabama

In [12]:
player_df["Date"] = player_df.Date.str.split(",", expand = True)
player_df["Month"] = player_df["Date"].str[:3]
player_df.head()

             Player    Date        City    State Month
0    Michael Ansley   Feb 8  Birmingham  Alabama   Feb
1      Keith Askins  Dec 15      Athens  Alabama   Dec
2       Carl Bailey  Apr 23  Birmingham  Alabama   Apr
3  Charles Barkley*  Feb 20       Leeds  Alabama   Feb
4      Eric Bledsoe   Dec 9  Birmingham  Alabama   Dec

In [13]:
#Take the columns needed
player_df1 = player_df[["Player","Month","City","State"]].copy()
player_df1.head()

             Player Month        City    State
0    Michael Ansley   Feb  Birmingham  Alabama
1      Keith Askins   Dec      Athens  Alabama
2       Carl Bailey   Apr  Birmingham  Alabama
3  Charles Barkley*   Feb       Leeds  Alabama
4      Eric Bledsoe   Dec  Birmingham  Alabama

In [14]:
player_df1.rename(columns={"Player":"PLAYER",'Month':'MONTH','City':'CITY','State':'STATE'},inplace=True)
player_df1= player_df1.reset_index()
player_df1.head()

   index            PLAYER MONTH        CITY    STATE
0      0    Michael Ansley   Feb  Birmingham  Alabama
1      1      Keith Askins   Dec      Athens  Alabama
2      2       Carl Bailey   Apr  Birmingham  Alabama
3      3  Charles Barkley*   Feb       Leeds  Alabama
4      4      Eric Bledsoe   Dec  Birmingham  Alabama

In [ ]:
#Connect to local database

In [15]:
rds_connection_string = "<>:<>@localhost:3306/sports_db"
engine = create_engine(f'mysql+pymysql://{rds_connection_string}')

In [16]:
engine.table_names()

['NCAAF_data', 'NFL_data']

In [17]:
player_df1.to_sql(name='NBA_player_CSM', con=engine, if_exists='append', index=False)

In [18]:
finalNba.to_sql(name='NBA_player_school', con=engine, if_exists='append', index=False)